app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("name", "bio", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @profile = Profile.new(profile_params)
    render template: 'profiles/scrapping' if @profile.save

SELECT "profiles".* FROM "profiles" WHERE ((name ILIKE '%pla%') OR (bio ILIKE '%pla%'))
SELECT "profiles".* FROM "profiles"
---
  def index
    @profiles = if params[:term]
                  Profile.where('name ILIKE ?', "%#{params[:term]}%")
                else
                  @profiles = Profile.all

DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 9]]
---
  def destroy
    respond_to do |format|
      @profile.destroy